import React from "react";
import { Meta, StoryFn } from "@storybook/react";
import TipDetail, { TipDetailProps } from "./tip-detail";
import { within, userEvent } from "@storybook/testing-library";

export default {
  title: "Organisms/TipDetail",
  component: TipDetail,
} as Meta<typeof TipDetail>;

const Template: StoryFn<typeof TipDetail> = (
  args: React.JSX.IntrinsicAttributes & TipDetailProps
) => <TipDetail {...args} />;

export const Default = Template.bind({});
Default.args = {
  img: "./healthTips/image 6.svg",
  title: "ផ្លែ​ឈើ​ទាំង​៨​មុខ​នេះ ល្អ​សម្រាប់​សុខភាពបេះដូង",
  subtitle: "​យើង​និង​លើក​យក​ផ្លែ​ឈើ​៨​មុខ​ មក​និយាយ...",
  detail: " ",
  details: {
    _id: "1",
    content:
      "ក្នុង​អត្ថបទ​នេះ​យើង​និង​លើក​យក​ផ្លែ​ឈើ​៨​មុខ​ មក​និយាយ​ដោយ​សុទ្ធ​សឹង​តែ​​ល្អ​សម្រាប់​សុខភាព​បេះដូង។",
    detailTitle: [
      {
        _id: "1",
        text: "ផ្លែ​ឈើ​ទាំង​៨​មុខ​នេះ ល្អ​សម្រាប់​សុខភាពបេះដូង",
        dropdownItem: [
          {
            _id: "1",
            text: "១.ប្លូបឺរី",
            href: "ផ្លែ​ប៊្លូប៊ឺរី​មាន​រសជាតិ​ឆ្ងាញ់​ហើយ​ថែម​ទាំង​សម្បូរ​ទៅ​ដោយ​សារធាតុ​ប្រឆាំង​អុកស៊ីតកម្ម​ដែល​អាច​បន្ថយ​សម្ពាធ​ឈាម​ និង​ការ​រីក​សរសៃឈាម។ ការ​ញ៉ាំ​​ផ្លែ​ប៊្លូបឺរី​​ក្នុង​បរិមាណ​ប្រហែល​មួយ​កែវ​ អាច​ជួយ​កាត់​បន្ថយ​ហានិភ័យ​​ជំងឺ​សរសៃ​ឈាម​បេះដូង។ យើង​ក៏​​អាច​យកផ្លែ​ឈើ​មួយ​ប្រភេទ​នេះ​​មក​ច្នៃ​ជា​ភេសជ្ជៈ​បាន​ផង​ដែរ​។",
          },
          {
            _id: "2",
            text: "២.ផ្លែ​ក្រូចថ្លុង",
            href: "ផ្លែ​ក្រូចថ្លុង​មាន​ផ្ទុក​សារ​ជាតិ flavonoids ខ្ពស់​ដែល​អាច​ជួយ​កាត់​បន្ថយ​ហានិភ័យ​នៃ​ជំងឺ​គ្រោះ​ថ្នាក់​សរសៃ​ឈាម​ខួរ​ក្បាល។ ក្រូច​ថ្លុង​​ក៏​មាន​បរិមាណ​វីតាមីន C ខ្ពស់​អាច​បន្ថយ​ហានិភ័យ​នៃ​ជំងឺ​បេះដូង​ផង​ដែរ។ ក្រូច​ប្រភេទ នេះ ​ក៏​ជា​ផ្លែ​ឈើ​ដ៏​ល្អ​ឥត​ខ្ចោះ​សម្រាប់​ញ៉ាំ​​ជា​មួយ​អាហារផង​ដែរ​។",
          },
          {
            _id: "3",
            text: "៣.ផ្លែ​ប៊ឺរ",
            href: "ពពួក​ផ្លែ​ប៊ឺរ​ គឺ​ជា​ផ្លែ​ឈើ​ដែល​ល្អ​សម្រាប់​សុខភាព​ និង​មាន​រសជាតិ​ឆ្ងាញ់ ហើយ​វា​ក៏​សម្បូរ​ទៅ​ដោយ​សារធាតុ​ខ្លាញ់​មិន​ឆ្អែត​​អាច​កាត់​បន្ថយ​កូលេស្តេរ៉ូល​ ​ដែល​កូលេស្តេរ៉ូល​នេះអាច​បណ្ដាល​ឲ្យ​មាន​ជំងឺ​បេះដូង។",
          },
          {
            _id: "4",
            text: "៤.ផ្លែ​ទទឹម",
            href: "ផ្លែទទឹម​ជា​ប្រភេទ​ផ្លែ​ឈើ​ដែល​មាន​រសជាតិ​ផ្អែម​ និង​ពោរ​ពេញ​ទៅ​ដោយ​សារធាតុ polyphenols ​ជួយ​ដល់​​សរសៃ​ឈាម​ និង​បេះដូង​​ឲ្យ​មាន​សុខភាព​ល្អ។ ការ​ញ៉ាំ​​ទឹក​ផ្លែ​ទទឹម​ជា​ប្រចាំ​វា​ជួយ​កាត់​បន្ថយ​កម្រិត​សម្ពាធ​ឈាម។",
          },
          {
            _id: "5",
            text: "៥.ផ្លែ​ក្រូច",
            href: "គ្នា​យើង​ច្បាស់​ជា​គិត​ថា​ផ្លែ​ក្រូច​អាច​ជួយ​ប្រឆាំង​ជា​មួយ​ជំងឺ​ផ្ដាសាយ​តែ​មួយ​មុខ​ទេ​ដោយ​សារ​តែ​វា​មាន​វីតាមីន A B6 និង C តែ​ក្រូច​ក៏​ជួយ​ដល់​សុខភាព​បេះដូង​​ដោយ​សារ​តែ​សម្បូរ​ទៅ​ដោយ​ជាតិ​សរសៃ ​ប៉ូតាស្យូម​ និងcholine។ ប៉ូតាស្យូម​​ជួយ​កាត់​បន្ថយ​ហានិភ័យ​នៃ​ជំងឺ​សរសៃ​ឈាម​បេះដូង​​របស់​យើង។",
          },
          {
            _id: "6",
            text: "៦.ផ្លែ​គីវី",
            href: "ជា​ផ្លែ​ឈើ​ដែល​សំបូរ​ទៅ​ដោយ​វីតាមីន C និងE ព្រម​ទាំង​ជា​ប្រភព​របប​អាហារ​មាន​ជាតិ​សរសៃ​ផង​ដែរ។ ជា​ទូទៅ​អាហារ​ដែល​មាន​ជាតិ​សរសៃ​ខ្ពស់​អាច​ធ្វើ​ឱ្យ​យើង​ឆ្អែត​បាន​យូរ​ និង​ជួយ​ដល់​ការ​គ្រប់​គ្រង​សម្ពាធ​ឈាម កូឡេស្តេរ៉ូល និង​ជាតិ​ស្ករ​ក្នុង​ឈាម។",
          },
          {
            _id: "7",
            text: "៧.ផ្លែ​ប៉ោម",
            href: "ផ្លែ​ប៉ោម​គឺ​ជា​ផ្លែ​ឈើ​ដែល​មាន​សារ​ធាតុ​ប្រឆាំង​អុកស៊ីតកម្ម វីតាមីន សម្បូរ​ជាតិ​សរសៃ និង​សារ​ធាតុ​ចិញ្ចឹម​ផ្សេងៗ​ជា​ច្រើន​ និង​មាន​អត្ថ​ប្រយោជន៍​ចំពោះ​សុខភាព​បេះដូង។",
          },
          {
            _id: "8",
            text: "៨.ក្រូច​ឆ្មា",
            href: "​ក្រូចឆ្មា ​មាន​រសជាតិ​ជូរ ប៉ុន្តែ​វា​មាន​អត្ថប្រយោជន៍​មិន​ចាញ់​ក្រូច​ផ្សេង​ៗដែរ ​ដោយ​សារ​តែ​សម្បូរ​ទៅ​ដោយ​វីតាមីន C និងអាច​​ជួយ​​កាត់​បន្ថយ​សម្ពាធ​ឈាម​ ធ្វើ​ឲ្យ​បេះដូង​មាន​សុខភាព​ល្អ។",
          },
        ],
      },
    ],
  },
  buttons: [
    {
      text: "ផ្លែ​ឈើ​ទាំង​៨​មុខ​នេះ ល្អ​សម្រាប់​សុខភាពបេះដូង",
      dropdownItems: [
        {
          _id: "5",
          text: "៥.ផ្លែ​ក្រូច",
          href: "គ្នា​យើង​ច្បាស់​ជា​គិត​ថា​ផ្លែ​ក្រូច​អាច​ជួយ​ប្រឆាំង​ជា​មួយ​ជំងឺ​ផ្ដាសាយ​តែ​មួយ​មុខ​ទេ​ដោយ​សារ​តែ​វា​មាន​វីតាមីន A B6 និង C តែ​ក្រូច​ក៏​ជួយ​ដល់​សុខភាព​បេះដូង​​ដោយ​សារ​តែ​សម្បូរ​ទៅ​ដោយ​ជាតិ​សរសៃ ​ប៉ូតាស្យូម​ និងcholine។ ប៉ូតាស្យូម​​ជួយ​កាត់​បន្ថយ​ហានិភ័យ​នៃ​ជំងឺ​សរសៃ​ឈាម​បេះដូង​​របស់​យើង។",
        },
      ],
    },
  ],
};

Default.play = async ({ canvasElement }) => {
  const canvas = within(canvasElement);

  await userEvent.click(canvas.getByText(/ជម្រើសក្នុងការអាន/i));
  await new Promise((resolve) => setTimeout(resolve, 1200));

  await userEvent.click(canvas.getByText(/៥.ផ្លែ​ក្រូច/i));
  await new Promise((resolve) => setTimeout(resolve, 1200));
};
